SunCity/src/Enums/СтатусыДокументовИСМПТК/СтатусыДокументовИСМПТК.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыДокументовИСМПТК</name>
  <comment>(Сервер)</comment>
  <enumValues>
    <name>Черновик</name>
    <comment>0</comment>
  </enumValues>
  <enumValues>
    <name>Отправлен</name>
    <comment>1</comment>
  </enumValues>
  <enumValues>
    <name>ОжидаетПриемку</name>
    <comment>3</comment>
  </enumValues>
  <enumValues>
    <name>ПринятПодтвержден</name>
    <comment>4</comment>
  </enumValues>
  <enumValues>
    <name>Отклонен</name>
    <comment>5</comment>
  </enumValues>
  <enumValues>
    <name>Отозван</name>
    <comment>16</comment>
  </enumValues>
  <enumValues>
    <name>Аннулирован</name>
    <comment>17</comment>
  </enumValues>
  <enumValues>
    <name>НаСогласовании</name>
    <comment>8</comment>
  </enumValues>
  <enumValues>
    <name>Ошибка</name>
    <comment>10</comment>
  </enumValues>
  <enumValues>
    <name>Проверяется</name>
    <comment>IN_PROGRESS</comment>
  </enumValues>
  <enumValues>
    <name>Оформлен</name>
    <comment>CHECKED_OK</comment>
  </enumValues>
  <enumValues>
    <name>ОшибкаПриПроверке</name>
    <comment>CHECKED_NOT_OK</comment>
  </enumValues>
  <enumValues>
    <name>ОшибкаПриОбработке</name>
    <comment>PROCESSING_ERROR</comment>
  </enumValues>
  <enumValues>
    <name>НеОпределен</name>
    <comment>UNDEFINED</comment>
  </enumValues>
  <enumValues>
    <name>Новое</name>
  </enumValues>
</mdclass:Enum>

SunCity/src/Enums/СтатусыДокументовИСМПТК/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДанныеВыбора = Новый СписокЗначений;
	ДанныеВыбора.Добавить(Перечисления.СтатусыДокументовИСМПТК.Черновик);
	ДанныеВыбора.Добавить(Перечисления.СтатусыДокументовИСМПТК.Отправлен);
	ДанныеВыбора.Добавить(Перечисления.СтатусыДокументовИСМПТК.ОжидаетПриемку);
	ДанныеВыбора.Добавить(Перечисления.СтатусыДокументовИСМПТК.ПринятПодтвержден);
	ДанныеВыбора.Добавить(Перечисления.СтатусыДокументовИСМПТК.Отклонен);
	ДанныеВыбора.Добавить(Перечисления.СтатусыДокументовИСМПТК.Отозван);
	ДанныеВыбора.Добавить(Перечисления.СтатусыДокументовИСМПТК.Аннулирован);
	ДанныеВыбора.Добавить(Перечисления.СтатусыДокументовИСМПТК.НаСогласовании);
	ДанныеВыбора.Добавить(Перечисления.СтатусыДокументовИСМПТК.Ошибка);
	ДанныеВыбора.Добавить(Перечисления.СтатусыДокументовИСМПТК.Новое);
	
	ДанныеВыбора.Добавить(Перечисления.СтатусыДокументовИСМПТК.Проверяется);
	ДанныеВыбора.Добавить(Перечисления.СтатусыДокументовИСМПТК.Оформлен);
	ДанныеВыбора.Добавить(Перечисления.СтатусыДокументовИСМПТК.ОшибкаПриПроверке);
	ДанныеВыбора.Добавить(Перечисления.СтатусыДокументовИСМПТК.ОшибкаПриОбработке);
	ДанныеВыбора.Добавить(Перечисления.СтатусыДокументовИСМПТК.НеОпределен);

КонецПроцедуры

#КонецОбласти

#КонецЕсли
